In [7]:
import pandas as pd

In [38]:
df=pd.read_csv("Salary_Data.csv")

In [9]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [11]:
df['Gender']==  'Male'

0        True
1       False
2        True
3       False
4        True
        ...
6699    False
6700     True
6701    False
6702     True
6703    False
Name: Gender, Length: 6704, dtype: bool

In [12]:
gender_filter=df['Gender']== 'Male' #Mask

In [13]:
df[gender_filter]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6696,28.0,Male,PhD,Sales Representative,4.0,55000.0
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [14]:
df[df['Gender']== 'Male']

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6696,28.0,Male,PhD,Sales Representative,4.0,55000.0
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [16]:
df[df['Job Title'] == 'Software Engineer']

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
376,28.0,Female,Bachelor's,Software Engineer,3.0,125000.0
380,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
384,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
388,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
...,...,...,...,...,...,...
6191,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6205,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6219,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6233,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0
6247,27.0,Male,Bachelor's Degree,Software Engineer,3.0,80000.0

In [18]:
df[ (df['Job Title'] == 'Software Engineer') & (df['Gender'] =='Female')]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
376,28.0,Female,Bachelor's,Software Engineer,3.0,125000.0
380,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
384,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
388,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
392,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
...,...,...,...,...,...,...
3380,30.0,Female,Bachelor's Degree,Software Engineer,5.0,90000.0
4396,31.0,Female,Bachelor's Degree,Software Engineer,5.0,74000.0
5885,32.0,Female,Master's Degree,Software Engineer,9.0,120000.0
6012,33.0,Female,Master's Degree,Software Engineer,8.0,120000.0
6133,26.0,Female,Master's Degree,Software Engineer,2.0,75000.0

In [19]:
df['Job Title']

0           Software Engineer
1                Data Analyst
2              Senior Manager
3             Sales Associate
4                    Director
                ...
6699    Director of Marketing
6700          Sales Associate
6701        Financial Manager
6702        Marketing Manager
6703          Sales Executive
Name: Job Title, Length: 6704, dtype: object

In [22]:
df[(df['Job Title'] == 'Software Engineer') |(df['Education Level'] == "Master's Degree") ]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
376,28.0,Female,Bachelor's,Software Engineer,3.0,125000.0
380,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
384,31.0,Female,Bachelor's,Software Engineer,6.0,155000.0
388,29.0,Female,Bachelor's,Software Engineer,4.0,140000.0
...,...,...,...,...,...,...
6683,51.0,Female,Master's Degree,Content Marketing Manager,19.0,190000.0
6688,46.0,Male,Master's Degree,Director of Marketing,16.0,160000.0
6693,43.0,Female,Master's Degree,Sales Manager,14.0,140000.0
6697,51.0,Female,Master's Degree,Senior Product Marketing Manager,19.0,190000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [24]:
df[~(df['Job Title'] == 'Software Engineer')] # not

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [28]:
df[df['Job Title'].isin(['Data Analyst','Director','Financial Manager'])]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
4,52.0,Male,Master's,Director,20.0,200000.0
24,41.0,Male,Master's,Financial Manager,13.0,140000.0
81,41.0,Female,Master's,Data Analyst,13.0,80000.0
378,27.0,Female,Bachelor's,Data Analyst,2.0,110000.0
...,...,...,...,...,...,...
6645,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6662,42.0,Male,Bachelor's Degree,Financial Manager,13.0,130000.0
6673,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6690,42.0,Male,Bachelor's Degree,Financial Manager,13.0,130000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0

In [29]:
df.at[0,'Job Title']= None

In [30]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [31]:
df.at[1,'Job Title'] = pd.NA

In [32]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,<NA>,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [35]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,<NA>,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [36]:
df[df['Job Title'].str.contains('Manager',na=False)]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
11,48.0,Female,Bachelor's,HR Manager,18.0,140000.0
13,40.0,Female,Master's,Project Manager,14.0,130000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6695,33.0,Female,Bachelor's Degree,Content Marketing Manager,7.0,90000.0
6697,51.0,Female,Master's Degree,Senior Product Marketing Manager,19.0,190000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [37]:
df[df['Job Title'].str.contains('Manager',na=True)]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,None,5.0,90000.0
1,28.0,Female,Master's,<NA>,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
...,...,...,...,...,...,...
6694,27.0,Male,High School,Digital Marketing Manager,2.0,40000.0
6695,33.0,Female,Bachelor's Degree,Content Marketing Manager,7.0,90000.0
6697,51.0,Female,Master's Degree,Senior Product Marketing Manager,19.0,190000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [39]:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [41]:
df[df['Age'] >=30]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
...,...,...,...,...,...,...
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0

In [42]:
df[ (df['Age'] >=30) & (df['Age'] <=40) ]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0
12,35.0,Male,Bachelor's,Financial Analyst,6.0,65000.0
...,...,...,...,...,...,...
6691,36.0,Female,PhD,Marketing Manager,9.0,95000.0
6695,33.0,Female,Bachelor's Degree,Content Marketing Manager,7.0,90000.0
6698,37.0,Male,Bachelor's Degree,Junior Sales Representative,6.0,75000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0